# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, CBAM, [1024]] # 9
  - [-1, 1, SPPF, [1024, 5]]  # 10

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 13
  - [-1, 1, CBAM, [512]] # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 17 (P3/8-small)
  - [-1, 1, CBAM, [256]] # 18

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 21 (P4/16-medium)
  - [-1, 1, CBAM, [512]] # 22

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 25 (P5/32-large)
  - [-1, 1, CBAM, [1024]] # 26

  # concatenating

  - [16, 2, C3STR, [256, False]]  # 27 (small)
  - [-1, 2, C3STR, [256, False]]  # 28 (small)
  - [-1, 2, C3STR, [256, False]]  # 29 (small)
  - [[-1, 18], 1, Concat, [1]]  # cat head P3
  - [-1, 1, NAM_Attention, [512]] # 31 (P3/8-small)

  - [20, 2, C3STR, [512, False]]  # 32 (medium)
  - [-1, 2, C3STR, [512, False]]  # 33 (medium)
  - [-1, 2, C3STR, [512, False]]  # 34 (medium)
  - [[-1, 22], 1, Concat, [1]]  # cat head P4
  - [-1, 1, NAM_Attention, [1024]] # 36 (P4/16-medium)

  - [24, 2, C3STR, [1024, False]]  # 37 (large)
  - [-1, 2, C3STR, [1024, False]]  # 38 (large)
  - [-1, 2, C3STR, [1024, False]]  # 39 (large)
  - [[-1, 26], 1, Concat, [1]]  # cat head P5
  - [-1, 1, NAM_Attention, [2048]] # 41 (P5/32-large)


  - [[31, 36, 41], 1, Detect, [nc]]  # Detect(P3, P4, P5)